{
  "package-id" : "hl7.fhir.dk.core",
  "title" : "HL7 FHIR Implementation Guide: DK Core",
  "canonical" : "http://hl7.dk/fhir/core",
  "introduction" : "A FHIR Implementation Guide for the Danish common needs across healthcare sectors",
  "category" : "National Core",
  "list" : [
    {
      "version" : "current",
      "desc" : "Continuous Integration Build",
      "path" : "http://build.fhir.org/ig/hl7dk/dk-core",
      "status" : "ci-build",
      "current" : true
    },
    {
      "version" : "2.2.0",
      "path" : "http://hl7.dk/fhir/core/2.2.0",
      "status" : "release",
      "sequence" : "Release",
      "fhirversion" : "4.0.1",
      "date" : "2023-05-05",
      "current" : true,
      "descmd" : "DK-core version 2.2.0 has been approved by HL7 Denmark. During spring, 2023, this version will go through the needed evaluations to be approved for the national catalogue.\n\nThe changes between 2.1.0 and 2.2.0 is:\n\n* Addition of Observation profile with associated documentation and instances.\n* Updated all CPR-identifiers of the Patient instances.\n* Added experimental-status = false to all CodeSystems and ValueSets\n* Removed draft-status from identifiers."
    },
    {
      "version" : "2.1.0",
      "date" : "2022-11-08",
      "path" : "http://hl7.dk/fhir/core/2.1.0",
      "status" : "release",
      "sequence" : "Release",
      "fhirversion" : "4.0.1",
      "descmd" : "DK-core version 2.1.0 has been approved by HL7 Denmark, but it is not part of the national catalogue of ICT standards <br/> to be used in the Danish health care system (Sundhedsdatastyrelsens standardkatalog). The spring 2023 version is expected to go through the needed evaluations to be approved for the national catalogue. <br/> <br/>  The changes between 2.0.0 and 2.1.0 is: <br/>  • Addition of Condition profile with associated documentation and examples <br/> • A disclaimer has been added regarding use of dk-core. It can be read on the IG\\\\'s front page in section 1.7 and 1.8 <br/> • Unused LPR3 identifier has been removed <br/> • In the documentation of the patient profile, new details are described regarding NNDNK <br/> • Adding how to represent a GP in the documentation for Organization and Practitioner to avoid SOR vs. ydernummer issues. <br/> • Clarification of primary and secondary sector the in descriptions of the Organization and Practitioner profiles.<br/> • Explanation of the use of Danish/English in the \\\\'Language\\\\' section on the front page of dk-core <br/> • Insertion of specific terms/explanations on all slices and extensions in profiles. <br/> • Target group and inclusion in the standard catalog have been added in the \\\\'Scope\\\\' section on dk-core\\\\'s front page. <br/> • Documentation has been strengthened in Patient and Practitioner profiles in the \\\\'scope and usage\\\\' section. <br/> • The section \\\\'Connection between dk-core and common Danish architectures and standards\\\\' has been added to dk-core\\\\'s front page."
    },
    {
      "version" : "2.0.0",
      "desc" : "Release version 2.0.0 contains three DKcore profiles. In DkCorePatient the cardinality of the extensions dk-core-RegionalSubDivisionCodes and dk-core-municipalityCodes is changed from 0..* to 0..1 and the MustSupport flags are removed from Patient.id and Patient.name. DkCoreCprIdentifier.system is changed from a ValueSet to a fixed value, where both solutions contain the same OID. In DkCoreOrganization the binding strength of the ValueSet attached to the element Organization.type is changed from required to preferred.",
      "status" : "release",
      "sequence" : "Release",
      "history_template_repo" : "https://github.com/hl7dk/fhir-ig-history-template.git",
      "path" : "http://hl7.dk/fhir/core/2.0.0",
      "fhirversion" : "4.0.1",
      "date" : "2022-09-14"
    },
    {
      "version" : "1.1.0",
      "status" : "release",
      "date" : "2021-12-18",
      "desc" : "Release version 1.1.0 contains three DK core profiles. The Danish Core Practitioner and Organization profiles are both introduced in this release, and the Danish Core Patient profile has been updated with some minor changes. These updates include 1) change of the minimum allowed length from 15 to 11 units in the element for the SOR-identifier Patient.generalPractitioner:referencesSORUnit.identifier, 2) removal of the fixed value 'NNDNK' in the element Patient.identifier.type.coding.code, and 3) change of the invariant expression for validation of a CPR.",
      "sequence" : "Release",
      "history_template_repo" : "https://github.com/hl7dk/fhir-ig-history-template",
      "path" : "http://hl7.dk/fhir/core/1.1.0",
      "fhirversion" : "4.0.1"
    }
  ]
}
